export const write = {
  introduction:
    "👋 안녕하세요 저는 92년생 추홍규 입니다. 이제는 특별할 것도 없는 비전공자 개발자입니다. 시간을 내여 저의 글을 읽어주셔서 감사합니다.",
  about: {
    main_txt: "코딩을 처음 접하게 된 일",
    sub_txt1:
      "대학원에서 뉴미디어 아트 작품을 진행하면서 코딩을 처음 접하게 되었습니다. 비행선을 자동으로 돌아다니게 하기 위해 아두이노 센서를 활용하고 자바 기반 미디어 아트 프로그램 프로세싱을 통해 인터랙티브한 디지털 화면을 구성했었습니다. 코딩은 제가 할 수 없던 영역의 일을 할 수 있게 만들어주었다. 점차 재미를 느끼게 되었습니다.",
    sub_txt2:
      "2021년 유니티라는 프로그램에 대해 알게 되었습니다. 유튜브를 통해 조금씩 유니티 공부를 하던 저는 결국 게임 앱을 만들어 보기로 결심했습니다. '서랍 속 슬라임', '스티커 슬라임'이라는 캐주얼한 게임을 2개 만들고 안드로이드, 애플 스토어에 동시 배포하게 되었습니다. 이 게임들은 구글 애드몹 배너, 보상 광고, 유료 결제 시스템을 갖고 있습니다. 개발을 하면서 모르는 것들은 전부 구글에서 하나씩 찾아 공부하며 해결해 갔습니다. 예를 들어 애플스토어에서는 2021년도부터 앱은 유저들에게 앱 추적 허용이라는 동의를 받아야 했습니다. 새로 생긴 플랫폼의 규정에 맞게 저 또한 개발자로서 빠르게 문제를 해결해야 했습니다. 다국어로 유저들에게 그것을 설명해 줘야 하기 때문에 초보인 저는 굉장히 해결하기 어려웠던 기억이 있습니다.",
    sub_txt3:
      "눈이 너무 아프지만 디버그(.Logo)를 통해 하나씩 순차적으로 해결해 가며 밤을 새웠던 기억들, 구글에서 영어로 모르는 것들을 찾아갔던 경험들은 전반적으로 코딩에 자신감을 주었습니다.",
  },
};
