export const write = {
  introduction:
    "👋 안녕하세요. 저는 현대 미술을 하다가 개발자로 전향한 92년생 추홍규 입니다. 시간을 내어 글을 읽어주셔서 감사합니다.",
  about: [
    {
      main_txt: "코딩을 처음 접하게 된 일",
      sub_txt1:
        "대학원에서 뉴미디어 아트 작품을 진행하면서 코딩을 처음 접하게 되었습니다. 비행선을 자동으로 돌아다니게 하기 위해 아두이노 센서를 활용하고 자바 기반 미디어 아트 프로그램 프로세싱을 통해 인터랙티브한 디지털 화면을 구성했었습니다. 코딩은 제가 할 수 없던 영역의 일을 할 수 있게 만들어주었다. 점차 재미를 느끼게 되었습니다.",
      sub_txt2:
        "2021년 유니티라는 프로그램에 대해 알게 되었습니다. 유튜브를 통해 조금씩 유니티 공부를 하던 저는 결국 게임 앱을 만들어 보기로 결심했습니다. '서랍 속 슬라임', '스티커 슬라임'이라는 캐주얼한 게임을 2개 만들고 안드로이드, 애플 스토어에 동시 배포하게 되었습니다. 이 게임들은 구글 애드몹 배너, 보상 광고, 유료 결제 시스템을 갖고 있습니다. 개발을 하면서 모르는 것들은 전부 구글에서 하나씩 찾아 공부하며 해결해 갔습니다. 예를 들어 애플스토어에서는 2021년도부터 앱은 유저들에게 앱 추적 허용이라는 동의를 받아야 했습니다. 새로 생긴 플랫폼의 규정에 맞게 저 또한 개발자로서 빠르게 문제를 해결해야 했습니다. 다국어로 유저들에게 그것을 설명해 줘야 하기 때문에 초보인 저는 굉장히 해결하기 어려웠던 기억이 있습니다.",
      sub_txt3:
        "눈이 너무 아프지만 디버그(.Logo)를 통해 하나씩 확인하며 오류들을 순차적으로 해결해 가며 밤을 새웠던 기억들, 영어도 잘 못하는데 구글에서 모르는 것들을 찾아 구현했던 경험들은 전반적으로 코딩에 자신감을 주었습니다.",
    },
    {
      main_txt: "진지하게 개발 공부를 하며 부딪힌 벽",
      sub_txt1:
        "개발 공부를 처음 본격적으로 배우기 시작한 것은 2021년 노마드 코더 인터넷 강의를 통해서입니다. html, css, 바닐라 자바스크립트, scss 순으로 챌린지를 진행하며 통과하였습니다. 사실 홈페이지를 디자인 만하는 정도인 것이고 기능이 없었음에도 스스로 코딩을 잘한다고 생각하며 신나 있었습니다. 그러다 리액트 챌린지를 도전했고 실패하고 말았습니다. 리액트 챌린지에 도전하면서 자바스크립트에 대해 전혀 모르고 있었다는 것을 알게 되었습니다. 그리고 나서 '내가 개발자를 진짜 할 수 있는 것일까?' 생각하게 되었습니다.",
    },
    {
      main_txt: "마포구청에서 기억에 남는 프로젝트",
      sub_title1: "마포 버디즈 소개 홈페이지",
      sub_txt1:
        "2022 캐릭터 라이선싱 페어에 마포구청도 참가하였습니다. 캐릭터팀이 그동안에 만든 캐릭터를 그곳에서 선보이는 것이었고 저는 ‘버디즈’팀과 함께 버디즈를 소개하는 홍보 사이트를 만들었습니다.",
      sub_txt2:
        "준비 기간은 한달이라는 짧은 기간이었고 ‘노션’을 통해 일정을 짜고 버디즈 팀과 자주 회의를 할 계획을 세웠습니다. 그러나 버디즈 팀과 회의 첫날부터 많이 당황하게 되었습니다. 간단한 홍보 홈페이지를 만드는 것만이 아니라 이메일 구독 시스템, 정치 뉴스레터 검색 등 다양한 콘텐츠를 요구하였습니다. 프론트엔드 혼자서 한 달 만에 그것들을 구현하기 어렵다는 것을 설명하는 것이 굉장히 어려웠습니다.",
      sub_txt3:
        "저는 ‘YES’라 대답하는 개발자가 되어야겠다는 나름의 포부가 있었지만 기획자들은 저의 상상을 초월했습니다. 2주동안 여러 번 회의를 통해 서로 의견을 나누고 조율의 과정을 거쳐서 email.js를 활용하여 200건만 이메일을 받을 수 있는 시스템을 넣는 것으로 합의가 이루어졌습니다. 기획이 확정되고나니 실질적인 개발 기간은 2주뿐이었고 빠듯하게 개발 하여 전시 전에 겨우 완성을 하였습니다.",
      sub_txt4:
        "몸은 힘들었지만 홈페이지를 완성하고 버디즈 팀원들이 좋아해 주는 것을 보니 뿌듯했습니다. 프로젝트를 통해서 개발도 중요하지만 팀원들끼리 의견을 조율하는 것이 매우 중요하다는 것을 배우게 되었습니다. 이런 경험으로 다른 프로젝트에서 기획자, UX/UI, 백엔드 모두가 너무 소중하고 고맙다고 느껴졌습니다. 협업하는 프로젝트를 통하여 소통하면서 작업을 하는 것에 보다 익숙해진 프론트엔드가 되었다고 생각합니다.",
    },
    {
      main_txt: "개발 일을 하며 내가 느낀점",
      sub_title1: "비전공자로서 부족한 점, 해결하기 위한 노력",
      sub_txt1:
        "현대미술을 해왔던 저는 UX/UI, CSS 부분에서 개발 이해가 쉬웠습니다. 모달 창이나 슬라이드 컨테이너를 만들어도 다른 팀원들에 비해 어떻게 하면 유저에게 좋은 경험을 남길 수 있을지 본능적으로 알고 있었던 것 같습니다. 하지만 전공자들에 비해 컴퓨터 지식, 웹 엔진, 자바스크립트 원리에 대한 이해도가 떨어진다고 생각하게 되었습니다. 회사에 가면 상사가 일을 시켜도 시킨 일이 뭔지 몰라서 일을 못한다는 말을 들었습니다. 이것을 해결하기 위해 노력을 많이 하고 지금도 하는 중일 것입니다.",
    },
  ],
};
