export const write = {
  introduction:
    "👋 안녕하세요. 저는 현대 미술을 하다가 개발자로 전향한 92년생 추홍규 입니다. 시간을 내어 글을 읽어주셔서 감사합니다.",
  about: [
    {
      main_txt: "순수 미술에서 개발자로 전향한 이유",
      sub_txt1:
        "미술 작업을 하면서 나의 생각과 의도대로 표현하지 못하는 것들이 많았습니다. 하지만 코딩을 하면서 컴퓨터 안에서 스스로가 자유롭다는 생각이 들었습니다.",
      sub_txt2:
        "인터랙티브한 코딩이 정말 재미있어서 개발자를 선택한 이유도 있지만 개발자라는 직업이 참 멋있다고 생각합니다. 개발자들은 직장인이지만 자신의 발전 방향을 선택해서 회사를 정하고 해결해야 할 문제를 자신의 도전과제로 여기기도 합니다. 또한 현업에 오래 계신 개발자들은 개발 문화를 좋게 하고자 계속 고민해 주시고 노력합니다. 깃허브의 설립부터 오픈소스로 공유를 목적으로 이루어져서 인지 개발자라는 직업이 다른 직업보다 팀원들과 친근하다고 생각합니다. 협업이 중요하지만 창의력과 실력도 중요하기에 정해진 틀에 갇혀 있지 않다고 생각합니다.",
      sub_txt3:
        "저는 다른 개발자들이 올려준 오픈 소스들을 사용하여  깃허브를 이쁘게 꾸몄습니다. 개발자로서 제가 계속 성장한다면 다른 개발자들에게 제가 꾸몄던 소스들 처럼 간단한 코드를  만들어 공유하여 개발자 문화에 도움을 주고 싶습니다.",
    },
    {
      main_txt: "동적인 홈페이지에 대한 집착(관심 있는 개발 분야)",
      sub_txt1:
        "개발 공부를 하면서 제일 관심이 있는 분야는 인터랙티브한 홈페이지를 만드는 것입니다. 코딩을 전문적으로 배우기 전에 미디어 아트나 게임을 만들었습니다. 프론트엔드가 유저에게 좋은 경험을 선사하는 것은 작가가 그림을 전시하여 사람들로 하여금 좋은 추억을 만들어 주는 것과 비슷하다고 생각합니다. 현재는 취미로 png, svg,  3d모델을 다뤄 인터랙티브한 코딩 작업을 즐기고 있습니다. 아름다운 버튼, 멋있는 모달과 힙한 슬라이드 창 등을 만들면서 처음 이것들을 생각해낸 사람들이 대단하다고 생각합니다. 저 또한 멋있는 로딩 화면, 오프닝, 쿨하게 닫히는 화면 등을 개발해 내고 싶습니다. 동적인 움직임이 가득한 홈페이지를 만드는 것은 정말 적성에 맞습니다. 그리고 그러한 고민이 재미가 있고 그 원동력으로 다른 개발 분야도 공부하고 있습니다.",
    },
    {
      main_txt: "마포구청에서 기억에 남는 프로젝트",
      sub_title1: "마포 버디즈 소개 홈페이지",
      sub_txt1:
        "2022 캐릭터 라이선싱 페어에 마포구청도 참가하였습니다. 캐릭터팀이 그동안에 만든 캐릭터를 그곳에서 선보이는 것이었고 저는 ‘버디즈’팀과 함께 버디즈를 소개하는 홍보 사이트를 만들었습니다.",
      sub_txt2:
        "준비 기간은 한달이라는 짧은 기간이었고 ‘노션’을 통해 일정을 짜고 버디즈 팀과 자주 회의를 할 계획을 세웠습니다. 그러나 버디즈 팀과 회의 첫날부터 많이 당황하게 되었습니다. 간단한 홍보 홈페이지를 만드는 것만이 아니라 이메일 구독 시스템, 정치 뉴스레터 검색 등 다양한 콘텐츠를 요구하였습니다. 프론트엔드 혼자서 한 달 만에 그것들을 구현하기 어렵다는 것을 설명하는 것이 굉장히 어려웠습니다.",
      sub_txt3:
        "저는 ‘YES’라 대답하는 개발자가 되어야겠다는 나름의 포부가 있었지만 기획자들은 저의 상상을 초월했습니다. 2주동안 여러 번 회의를 통해 서로 의견을 나누고 조율의 과정을 거쳐서 email.js를 활용하여 200건만 이메일을 받을 수 있는 시스템을 넣는 것으로 합의가 이루어졌습니다. 기획이 확정되고나니 실질적인 개발 기간은 2주뿐이었고 빠듯하게 개발 하여 전시 전에 겨우 완성을 하였습니다.",
      sub_txt4:
        "몸은 힘들었지만 홈페이지를 완성하고 버디즈 팀원들이 좋아해 주는 것을 보니 뿌듯했습니다. 프로젝트를 통해서 개발도 중요하지만 팀원들끼리 의견을 조율하는 것이 매우 중요하다는 것을 배우게 되었습니다. 이런 경험으로 다른 프로젝트에서 기획자, UX/UI, 백엔드 모두가 너무 소중하고 고맙다고 느껴졌습니다. 협업하는 프로젝트를 통하여 소통하면서 작업을 하는 것에 보다 익숙해진 프론트엔드가 되었다고 생각합니다.",
    },
    {
      main_txt: "개발 일을 하며 내가 느낀점",
      sub_title1: "비전공자로서 부족한 점, 해결하기 위한 노력",
      sub_txt1:
        "현대미술을 해왔던 저는 UX/UI, CSS 부분에서 개발 이해가 쉬웠습니다. 모달 창이나 슬라이드 컨테이너를 만들어도 다른 팀원들에 비해 어떻게 하면 유저에게 좋은 경험을 남길 수 있을지 본능적으로 알고 있었던 것 같습니다. 하지만 전공자들에 비해 컴퓨터 지식, 웹 엔진, 자바스크립트 원리에 대한 이해도가 떨어진다고 생각하게 되었습니다. 회사에 가면 상사가 일을 시켜도 시킨 일이 뭔지 몰라서 일을 못한다는 말을 들었습니다. 이것을 해결하기 위해 노력을 많이 하고 지금도 하는 중일 것입니다.",
    },
  ],
};
